[
  {
    "SessionId": "4c0b9b33-a78d-4372-8389-a5e71f2d99e1",
    "SessionTitle": "2FA, WTF?",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Everyone is hacking everything. Everything is vulnerable. Your site, your users, even you. Are you worried about this? You should be!\r\n\r\nDon't worry, I'm not trying to scare you (that much). We have plenty of safeguards against attempts on our applications' user data. We all (hopefully) recognise Two Factor Auth as one of those safeguards, but what actually goes on under the hood of 2FA?\r\n\r\nWe'll take a look into generating one time passwords, implementing 2FA in web applications and the only real life compelling use case for QR codes. Together, we'll make the web a more secure place."
  },
  {
    "SessionId": "c4ab317a-4f95-4670-8130-744363bc185d",
    "SessionTitle": "6 weeks in Redmond doing Hololens development - travel notes",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Do you want to know how Hololens apps are developed inside Microsoft mothership in Redmond? \n\nI bet... I will share my experience of being part of dev team sent to Redmond. I will talk about methodology used, tools. Even, thanks to number of NDA's lifted, I will show a demo. And trust me, it's awesome"
  },
  {
    "SessionId": "023afdcf-2693-4f4e-b9de-dcf196bafb78",
    "SessionTitle": "A developer's Leap of Faith into Machine Learning",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Drawboard is taking initial steps into Machine Learning and team has a scheduled short project with Microsoft. \n\nWe will document our findings and want to share a story (no matter it'll be success or failure) about developers approach to getting into machine learning."
  },
  {
    "SessionId": "a1c08893-0444-4a89-90d0-24cef5e20bff",
    "SessionTitle": "A Practical Introduction to Quantum Computing",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Quantum computing takes a giant leap forward from today’s technology—one that will forever alter our economic, industrial, academic, and societal landscape. \n\nThis presentation will cover the theoretical basics of quantum computing; the Microsoft Quantum Development Kit and Q# programing language; and some important applications of quantum computing."
  },
  {
    "SessionId": "dd44356b-bb4b-40d2-a9dd-a256ced8fb07",
    "SessionTitle": "A Software Developer or a Data Engineer?",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Everybody is talking about AI, Machine Learning, IoT, and Analytics. It's hard to dismiss these. Many people, especially developers, are looking to move to the new data roles. \n\nHowever, many are faced with lots of fragmented information, too many courses, different platforms, and lots of tools. I have gone through this journey myself. \n\nThrough some hard-work and some luck, I am currently a principal consultant for IoT and Analytics. In this session, I would like to take you on a journey to: \n\n1) Demystify all the jargons and break them down into smaller, more concise, and simpler terms (AI, ML, IoT, Edge Computing, etc.)\n2) Explore the career options for developers moving to data roles? \n3) What are the steps that you can take today to move into such roles? \n4) What are the tools that you need to be equipped with for your new gigs? \n\nThis is not a career-fair pitch. This is more to share my experience of what I have done, what worked and what did not. Finally, the hope is that you can benefit from the learning I have accumulated along the way."
  },
  {
    "SessionId": "87ebb6bc-ca35-4a8c-8694-6e0404f83573",
    "SessionTitle": "Accessibility is actually really easy",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Accessibility is commonly seen as something added to the end of a project if there is time. \n\nIn this session, we talk about how making a project Accessible is actually really easy if done at the right time, and how it can increase the usability of your project too. \n\nThis session is aimed at developers across web and mobile, as well as BA's, Creative Designers and UX designers."
  },
  {
    "SessionId": "dc818ccb-639b-414a-bf6a-d4d3a8ce0f03",
    "SessionTitle": "Advance Programming with TypeScript",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Discovering TypeScript for most people is a mind-blowing experience.\r\n\r\nStrong typing, refactor-friendly codebases and a pleasant language that closes the gap between full-featured backend languages and Javascript.\r\n\r\nBut it's that all TypeScript has to offer? Definitely not!!\r\n\r\nTypeScript is much more than that and I will help you discover those extra features are so that you can step-up your TypeScript skills to the next level."
  },
  {
    "SessionId": "84cd432b-8b57-463f-90a2-7a74910718c9",
    "SessionTitle": "Advanced integrations with Visual Studio Team Services",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "There's a lot in the box in VSTS, but sometimes it just isn't enough. Find out how you can integrate your existing applications and 3rd party services with VSTS via the VSTS API.\r\n\r\nDon't throw away all that existing infrastructure you've invested time and money in! Learn how to enable scenarios like leveraging your existing on-prem build server together with Git branch policies to ensure only code that successfully builds gets to be merged.\r\n\r\nMake VSTS work for you, so that it can help you to deliver the best quality software possible."
  },
  {
    "SessionId": "2b1959b4-4ea7-43de-b2f9-11fcea41f240",
    "SessionTitle": "All Hidden Things Distributed",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Modern software development \"on the cloud\" is done on distributed systems. While most developers don't need to know the details, these abstractions often leak out and surprise us in unexpected ways. \n\nI will talk about the fundamental principles of distributed systems that everyone needs to know, with some concrete examples from cloud providers"
  },
  {
    "SessionId": "aa9d1e30-fa5d-4cdf-9067-d459d600de61",
    "SessionTitle": "Am I a Good Developer?",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "\"Am I a Good Developer?\" is a question, I believe, we asked ourselves at least once in our lifetime as developers. In the pursuit of becoming better developers, we try to assess ourselves, but that's not an easy task! \r\n\r\nIn this session I will share with you my views on the questions we should ask ourselves to define what a good developer is, and identify the pitfalls we might fall in the pursuit of becoming one."
  },
  {
    "SessionId": "f20d2084-0e0d-4e15-b8fe-42fa1b45ae60",
    "SessionTitle": "Are you a good developer or a bad developer",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "No one really wants to be labelled \"bad developer\", however the sad reality is that a lot of us aren't even aware that we suck at coding.\r\n\r\nBut in order to fix this we must first understand what makes a developer good or and what makes them bad.\r\n\r\nIn this talk we will go through the characteristics of bad developers, good developers and really good developers. Then we look at some examples and finish off with some useful tips and tricks that makes our lives (and others around us) hell lot easier in our day to day jobs.\r\n\r\nSo what are you waiting for? Just vote for this talk and I'll see you soon..."
  },
  {
    "SessionId": "828d49ca-714d-4828-a6a0-8e328e2968f8",
    "SessionTitle": "(A)TDD in Action for Serverless Applications – Azure Functions and Logic Apps",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "TDD is cool. TDD in developing an application is cooler. But TDD in developing a serverless application is even cooler. In Azure Functions, it is relatively easy to apply TDD because the application is actually codes. However, in Azure Logic Apps, it is a workflow consisting of bunch of API calls, which we need to consider ATDD instead of TDD because there is no code.\r\n\r\nWhat is ATDD and what are differences between TDD and ATDD? How they are applied to application developments using Azure Functions and Logic Apps?\r\n\r\nAt the end of this session, audiences will learn 1) how to apply dependency injection into Azure Functions code, 2) how to apply TDD to Azure Functions, 3) why we need to consider ATDD for Azure Logic Apps, and 4) how to apply ATDD to Azure Logic Apps."
  },
  {
    "SessionId": "20f7db9f-22b2-4d84-a1fc-2625eb9ee4b1",
    "SessionTitle": "AWS for Azure Developers",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "I did a word count on all the sessions submitted for DDD for the words \"Azure\" and \"AWS\". The count was 65 and 9 respectively. This leads me to thinking that the DDD crowd has more exposure/affinity to Azure than AWS which is the largest public cloud. \n\nI have a strong Azure background but the current enterprise I am working is on a AWS journey. This has given me an unique opportunity to compare the two cloud platforms and I would like to share the similarities and differences between the two. \n\nIt will perhaps allow you to make a decision regarding choosing your cloud provider or at least for Azure developers make yourself aware of AWS."
  },
  {
    "SessionId": "621d6c08-bf74-4b77-a010-84654b416104",
    "SessionTitle": "Azure Dev Spaces deep dive",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Azure Dev Spaces allows developers to collaborate during development using AKS development cluster on Azure and VS Code, Visual Studio or CLI.\n\nLet's see how each developer can have your own developer space, allowing live sharing of spaces during development. No more \"push all your changes to git\" to allow testing of micro services integration, just share your space with other developers!"
  },
  {
    "SessionId": "d47b8da9-1c60-46d9-896d-362f42cdaec7",
    "SessionTitle": "Azure Functions Aren't Enterprisy, Are They?",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Most people think Azure Functions are only for a tiny bit of code. They will be surprised! Why not build your whole application following best practices and only expose the endpoints through functions? \n\nIn this talk, I'll present a new paradigm, a new way of thinking whilst still leveraging your existing knowledge."
  },
  {
    "SessionId": "6ba166c0-5eb0-449c-91ec-1e6f3325459f",
    "SessionTitle": "Azure Functions, Triggers and Bindings Deep Dive",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Since its announcement, developers have been using (and loving) Azure Functions. Part of this is due to the Trigger and Bindings concept, which facilitates the integration with additional services and technologies. \r\n\r\nNonetheless, Triggers and Bindings can be confusing, and difficult to troubleshoot, especially if dealt with like a black box. Well, the good news is that Azure Functions is Open Source! Which gives us much better understanding, and ease of troubleshooting. \r\n\r\nIn this session we will have a deep dive into Triggers and Bindings; we will look into the source code, understand how it functions behind the scenes, and demonstrate how we can extend Azure Functions using our own bindings."
  },
  {
    "SessionId": "8eeedaeb-1de3-4c4e-9699-614cf7312609",
    "SessionTitle": "Big data in action : Hadoop made easy in Azure",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Big data is one of those buzzwords that we’ve been subjected to for what seems like years now, but the hype hasn’t faded, in fact it is more relevant now than ever before. HDInsight is Microsoft’s big data offering through a managed service deployment of Hadoop. This makes it easier to query, ingest, and publish data and to create workflows that make sense for your organisation. \r\n\r\nIn this talk we will learn how to use Hadoop on Azure, create clusters, crunch data and consume the results in applications. A real world data set of 160 GB worth of data will be used to demo all major tools in Hadoop ecosystem like Pig, Hive, Storm, HBase & Spark. Lambda architecture will be briefly explained and demoed showing how to handle streaming and batch scenarios. \r\n\r\nThis talk will give you enough knowledge to tackle real world problems and you will have the knowledge of what tool can be used to solve a certain problem plus the experience of using those tools in action."
  },
  {
    "SessionId": "ca6f4f95-f515-4753-9123-9e65be0457b3",
    "SessionTitle": "Blazor: Screaming Past \"Hello World\", Straight into the Mundane.",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "AKA: \"Northwind in Blazor\" \n\nWow, hasn't TypeScript made client-side code so much better recently? I can sit and write code with tooling support, type checking, intellisense - why, it's almost feels like...\n\nAdmit It! What you really want is C# in the browser! And not in some plugin (nice try, Silverlight) I want C# properly in the browser! Well, with Blazor we might get just that!\n\nBut now we need to ask: Is it ready? Can I make #GenericClientApp17# with it? \n\nThis talk will attempt to answer these questions by taking the most boring database imaginable (Northwind) and smashing it into the most exciting web development project in decades (Blazor)."
  },
  {
    "SessionId": "bd0815c9-a5d3-4e86-a263-b11e7d448460",
    "SessionTitle": "Blockchain, Cloud and DevOps",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Blockchain is more than just Bitcoin and cryptocurrencies, it can be used as a consortium platform for your decentralised distributed systems with immutability by default. \r\n\r\nIn this session, the speaker will explain and demo how to set up your private Blockchain network in the cloud using Microsoft Azure. It will then be followed up by setting up the build and release pipeline of your \"Smart Contracts\" in VSTS (Visual Studio Team Services). Lastly, the audience will learn some roadmap strategy on how to deploy the contracts on Main (Public) Networks."
  },
  {
    "SessionId": "c87dec72-5bdf-4048-b3f3-2094ce2a0053",
    "SessionTitle": "Blockchain for Developers",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Blockchain has been a big buzz lately not only because of Bitcoin and cryptocurrencies; but also because of the disruption it brought in the ICT (Information & Communications Technology) Industry.\r\n\r\nIn this session, we will explore on what Blockchain is, in the perspective of developers. The audience will learn the fundamentals of Blockchain and how to create a \"Smart Contract\" as a form of programmable logic in the Blockchain network.\r\n\r\nIt will then be followed-up with a demo of a web application communicating with a smart contract in the Blockchain platform. Lastly, we will explore some good use cases of Blockchain in various industries."
  },
  {
    "SessionId": "202b288c-4122-49a8-89a6-45a57f2088f1",
    "SessionTitle": "Build your own GraphQL server in 10 minutes",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "GraphQL and its associated frontend libraries like Relay and Apollo Client are now reasonably well known in the industry. However, GraphQL backends are a little less understood. Whilst there are backend-as-a-service platforms available for applications that are entirely green-field, for the rest of us it’s more than likely that, in order to accomodate all of the intricacies of our business domain and infrastructure, we’ll have to build a GraphQL backend ourselves.\r\n\r\nIn this presentation I’ll show how it's surprisingly easy to get a basic GraphQL backend up-and-running in 10 minutes. After a brief introduction, I'll start the clock and use the Apollo Server framework to build a backend from scratch to service an existing client. Along the way I’ll introduce the concept of GraphQL resolvers and show how you write them, nest and pass data between them, and support both queries and mutations.\r\n\r\nHaving got the basics up and running in 10 minutes, I’ll then close with what the next steps would be for security and performance, and, for those with an aversion to JavaScript, what server frameworks are available for other languages. \r\n\r\nAttendees will leave this presentation with an understanding of the key concepts when building a GraphQL server, and an appreciation of just how easy it can be to get started."
  },
  {
    "SessionId": "eb73c00d-8185-4155-93b6-8615c4d8be60",
    "SessionTitle": "Building a Disabilty Sport Graph Database",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "I've been helping build a large disability sport database, running on the Wikimedia Foundation's Wikibase and the Blazegraph SPARQL database, hosted on different cloud providers. \n\nI'll show how the data can be stored, queried and visualised. I'll show how the system works inside - all the code is open source, both off the shelf and custom-written."
  },
  {
    "SessionId": "f91211b7-67a7-46ec-b142-58cb32daf2dd",
    "SessionTitle": "Building APIs for developers with Identity Server 4",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "You might be thinking \"Duh, all APIs are for developers\", but the reality is when it comes time to expose our API to third party developers, there are a few important security and logistical problems to conquer that you might not think about before hand. In this talk we take a look at the best way to protect your API using Identity Server 4 and walk through all the configuration you'll need to get third party devs up and running in no time.\r\n\r\nSpecifically we'll cover:\r\n- API first development and designing your API with third party developers in mind\r\n- Setting up Identity Server 4 with a basic real-world configuration\r\n- Protecting our API using JWTs and Bearer Authentication\r\n- Controlling access to API endpoints based on authentication policies"
  },
  {
    "SessionId": "b700dcb2-4e9d-4ab5-9fa3-36a65f135c59",
    "SessionTitle": "Building Cross-Platform Apps with Platform.Uno",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "So many so called cross platform frameworks leverage the native controls offered by each target platform. Platform.Uno takes a different approach, leveraging the tooling offered by Microsoft to design and build UWP applications to create pixel perfect applications for. \n\nIn this session you'll learn how to build, test and deploy a UWP application that cross-targets to iOS and Android."
  },
  {
    "SessionId": "5f27e3df-9dec-4ad5-8d64-1a24b705ca8b",
    "SessionTitle": "Building your cloud environment with Terraform",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Writing code is insufficient to unleash your creation upon an unsuspecting world. You must also provision some form of infrastructure on which to run it. Cloud services make this easy to do manually via their web UIs. However over time this becomes extremely painful to maintain. Humans are not just not good at applying changes to many resources in a consistent, error fashion. As you start to use more cloud services and have multiple environments it becomes certain you will misconfigure something leading to errors, inconsistent behaviour or security concerns.\r\n\r\nThe obvious solution is to automate infrastructure creation. Computers are good at doing repetitive things consistently and (mostly) error free. A number of tools now exist for the creation of infrastructure. I'm partial to Hashicorp's Terraform, an open source infrastructure as code tool. My employer is adopting Terraform to handle deployment and maintenance of infrastructure across multiple AWS accounts and environments.\r\n\r\nThis talk discusses how we use the tool, lessons we've learnt and the structure we've evolved to effectively handle making repeatable changes across out environments. I'll cover such things as how to organise your Terraform projects to allow effective collaboration within and between teams. It will also include demonstrations of building and updating real cloud infrastructure live via conference WiFi."
  },
  {
    "SessionId": "47415277-6d02-44ea-ab8b-bb0cda065ace",
    "SessionTitle": "Building Your Own Cognitive Service",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Neural networks are so hot right now, and APIs are always cool! Join me on an adventure of discussing, building and deploying a small and simple neural network driven API. \n\nThis session assumes little to no knowledge, and will attempt to present simplified explanations, alongside code for the more adventurous."
  },
  {
    "SessionId": "d757a546-2507-4de9-b384-190f499c573d",
    "SessionTitle": "Burn it down: A case study in CMS replatforming",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "A code heavy case study into the nose-to-tail relaunch of a major media company’s CMS. Through this the audience will get an insight into how building a CMS for enterprise differs from building a CMS for a small-to-medium business.\r\n\r\nBy sharing the practices of high-end WordPress, developers will leave eager to up-skill and continue using best-practices in an enterprise friendly manner. To keep the audience interested, I’ll be sharing code examples showing how WordPress can be used in non-standard ways.\r\n\r\nI’ll return to common themes throughout the presentation to tell a story: covering more than the how, but the why."
  },
  {
    "SessionId": "fa39e75c-3b6d-4b7f-8179-52d096f065e7",
    "SessionTitle": "CD and Pi and Docker, Oh My!",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Docker is the new hotness - and rightfully so. \n\nIn this talk I'll show you how to go from a standard Node Raspberry Pi app to a complete continuous delivery pipeline with containers, and we'll talk about why you'd even want to do that in the first place. 100% guaranteed to have DevOps magic."
  },
  {
    "SessionId": "4b4e8c52-7d63-47ae-adca-9a228099819d",
    "SessionTitle": "Clean Architecture with ASP.NET Core 2.1",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "The explosive growth of web frameworks and the demands of users have changed the approach to building web applications. Many challenges exist, and getting started can be a daunting prospect. Let's change that now.\r\n\r\nThis talk provides practical guidance and recommendations. We will cover architecture, technologies, tools, and frameworks. We will examine strategies for organizing your projects, folders and files. We will design a system that is simple to build and maintain - all the way from development to production. You leave this talk inspired and prepared to take your enterprise application development to the next level."
  },
  {
    "SessionId": "c912ec86-e450-41cb-80b0-11e1ba1c07d0",
    "SessionTitle": "CloudEvents – A Common Way of Describing Events by CNCF",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Events occur everywhere. But event publishers describe those events differently. There has been no way describing events in a common way, which make developers in their hard time to constantly re-learn how to consume events.\r\n\r\nCloudEvents is an open spec for event data driven by CNCF (Cloud Native Computing Foundation) and many industry vendors, including Azure, AWS, CGP, IBM and OpenStack, take part in setting up the spec. Any application implementing and/or consuming webhook can introduce this spec and Azure Event Grid is one of them.\r\n\r\nAt the end of this session, audiences will learn 1) what CloudEvents spec is, 2) how it can be implemented, 3) how Azure Event Grid copes with CloudEvents, and 4) How other popular platforms can redesign their events."
  },
  {
    "SessionId": "43c6d9b4-8b10-4422-a102-cd5e5bb3a8db",
    "SessionTitle": "Coding Cross Platform Augmented Reality",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Augmented Reality (AR) is a lot of fun. Most of us have seen the video where the \"Take On Me\" video clip was recreated in AR and like many of us, you may have had an \"Aha moment\" that Augmented reality can create some pretty amazing and unique experiences.\r\n\r\nThis session will show you how you can create engaging Augmented user experiences with C# for iOS, Android and other popular augmented and mixed reality devices using UrhoSharp. \r\n\r\nWe'll touch on the fundamental concepts, how to work with the 3D space, plane detection and show how we can bring a classic retro-style game into Augmented Reality."
  },
  {
    "SessionId": "54bedbdb-68a8-41e1-8399-164439468fdb",
    "SessionTitle": "Combining bicycle recycling and volunteer software development",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Back2bikes has been operating for 5 years, and has now grown to be open 6 days a week, engages 10-15 volunteers per day, and turns out between 5 and 10 restored bikes a week.\r\n\r\nAs it grows, the need for tracking systems becomes important. This talk will explain how we went about building an attendance app, so that volunteer attendance can be recorded in the database.\r\n\r\nWe built the app using the latest development tools, and will show how we have used the best practices and tools to build a world class app (which is also open source)."
  },
  {
    "SessionId": "0b6a898e-0310-4461-9374-448b58675b73",
    "SessionTitle": "Containers and Kubernetes: Why, what and how?",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Kubernetes is an open-source system for automating deployment, scaling, and management of containerized applications. It is quickly becoming a popular standard for managing and deploying software. \n\nIn this session, we'll take a lap around Kubernetes to get a simplified view of the core concepts and then work our way through a demo that puts those concepts into practice using Docker containers orchestrated with Kubernetes. \n\nWe'll also look into what's next and some of the open source projects that help with the maintenance of Kubernetes clusters."
  },
  {
    "SessionId": "bf894e1b-5766-40ea-87dd-29e8a157f9cd",
    "SessionTitle": "Containers high speed communication with gRPC protocol",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "gRPC is already used by multiple container applications to deliver ultra fast communication using HTTP/2 and libraries already available to multiple languages. \n\nLet's learn how to apply these concepts to our micro services communications, eliminating overhead, network traffic, and accelerating stream transfers. Still need REST API? no problem, we auto generate that for you."
  },
  {
    "SessionId": "beab03f7-8660-46b0-a080-239836ab07be",
    "SessionTitle": "Continuous Compliance with Intelligent Cloud Security",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Cloud computing environments can be very dynamic, autonomously shifting the scale and composition of infrastructure in response to demand. \n\nThis dynamism introduces different risks and vulnerability considerations. This session will expose the security challenges with Cloud Computing at scale and discuss innovative and intelligent security detection and remediation technologies. \n\nSpecifically, this session will: \n\n1) discuss potential cloud security events and their impact,  \n2) explain how AI/ML and intelligent security controls work in cloud,  \n3) provide a technical demonstration of intelligent security control in AWS cloud including continuous compliance at scale,   4) offer tips, tricks, and tools you can use for effective and automated cloud security. \n\nAs a result of attending this session, you will have greater awareness of top security threats in a cloud environment and practical mechanisms to detect, respond, and prevent threats at scale."
  },
  {
    "SessionId": "145dad67-1334-4f75-b216-efa9e8d5211c",
    "SessionTitle": "Continuous Delivery for Financial Services (and other \"impossible\" places)? Bring it!",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Isn't it great being in 2018 where everything is fully automated, blue-green deployments are the norm, and we press \"release\" then go straight to the pub... Right???\r\n\r\nWhoops... I work at a bank and deploy at 2am on Sunday mornings.\r\n\r\nWhat do you do when all of this cool shiny automation sounds so enticing, but compliance gets in your road? \r\n\r\nIn this talk, we'll walk through the real life story of bringing deployment goodness to a regulated environment, depended on by multiple financial institutions and processing sensitive consumer data. \r\n\r\nIt's might not be deploying every commit straight to prod, but we'll discuss some of the challenges of regulations like PCI compliance, where the limits are, and how you can still bring sanity and smoothness to the deployment pipeline."
  },
  {
    "SessionId": "4890431b-a5a7-4500-a4ac-cf8a5f0f0487",
    "SessionTitle": "Continuous Delivery for Majestic Monoliths",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "While microservices are all the rage these days, for many organisations the overhead and complexity required to manage and orchestrate a microservices application doesn’t make sense. But just because you’re not “doing microservices” doesn’t mean you can’t go on the journey to Continuous Delivery! \r\n\r\nIn this talk, we’ll discuss a number of techniques you can use to make your monolith more majestic multiple times per day or week, rather than once or twice a year. \r\n\r\nDrawing on real-world examples, we’ll talk about feature-flags, Platform-as-a-Service, and blue-green deployments as stepping stones to deploying frequently and without downtime. The techniques are applicable to all tech-stacks, but the examples will be .NET-focused."
  },
  {
    "SessionId": "7c58421d-b1bb-4a84-be6b-6d37662e94fc",
    "SessionTitle": "Contract Driven Development Mastercourse",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "If you've ever developed a web application, you've probably had to use several APIs in some kind of way.  As we move towards microservices, some of those interactions are starting to get overly complicated and makes developing them harder.\r\n\r\nThis is where Contract Driven Development can help with testing interactions between parties to make sure none of the \"contracts\" get broken with a simple change or fix.  The aim for this session to go through some of the theory with real world examples then transition into solutions by using an open source library called Pact that helps create these interactions and test them consistently."
  },
  {
    "SessionId": "527ae058-c86e-4603-99de-b82e6e721dfa",
    "SessionTitle": "Convince your boss to use your favourite tech",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "In this session I will assemble a panel of tech leads and development managers for you to pitch the tech you’d like to use for your net project or in your team. We’ll provide a safe environment to discuss which tech fits your team and or project"
  },
  {
    "SessionId": "cc946d2e-90c5-4a28-a02d-58f142a3217b",
    "SessionTitle": "Crafting compelling real-time web experiences with GraphQL and React",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Users expect real-time data. They want their banking transaction notifications now. Their orders confirmed now. They need prices accurate as of now. The want their user experience to feel—connected. The world has moved to push and users are waiting for the data-driven experiences we create on the web to catch up.\r\n\r\nGraphQL is Facebook’s response to this challenge and it is quickly proving itself as an attractive alternative to RESTful APIs for a wide range of contexts. GraphQL is a query language that provides a clean and simple syntax for consumers to interrogate your APIs. These queries are strongly typed, hierarchical and enable clients to retrieve only the data they need.\r\n\r\nIn addition to the familiar pull based request-response pattern, GraphQL provides a mechanism for clients to subscribe to real-time updates in the form of Subscriptions. Subscriptions are exciting as they represent the core ability we need to satisfy the connected experience that our users demand. \r\n\r\nIn this talk, we will take a hands-on look at GraphQL and see how it can be used to build real-time APIs that are a joy to use. Additionally, we will explore how to integrate a React client with GraphQL using the ultra flexible, community driven Apollo client. By the end of the session you will understand what is required to craft a compelling real-time user experience with GraphQL, and have the knowledge to deliver on these requirements."
  },
  {
    "SessionId": "49dc7e1d-63e7-498e-944c-dabfd20c7b34",
    "SessionTitle": "Deep dive in Helm Charts - the missing parts",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Helm is more than a package management to Kubernetes, allowing robust deployments with nested charts, testing, dashboard with Monocular/KubeApps, revision management and rollback. \n\nLet's dive in real case scenarios, and how we moved from pure Kube yaml files to full CI/CD with Helm and Jenkins. Multiple Helm servers/Tiller on the same cluster? no problem!"
  },
  {
    "SessionId": "565b9618-c1c5-4e84-b068-6ea67c8187af",
    "SessionTitle": "Deploy anything to Azure with VSTS",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Azure and Visual Studio Team Services are designed for any developer and any platform. This is a new Microsoft, one that embraces developers - not just those writing .NET for Windows. \n\nIn this session, I will show you the products and services that will shape your DevOps process and enable your teams to build amazing applications on Azure, no matter what language or platform you're using."
  },
  {
    "SessionId": "0efcf84f-f47e-480c-aa3a-523bdc1af765",
    "SessionTitle": "Despagghetifying code with NDepend",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "So you’ve been left with a huge bowl of spaghetti bolognese, also known as legacy code. You know you need to break it up to make it more maintainable and more workable. You’re sure there are some good places to make your cuts, but every time you pull on a code thread you end up with more spaghetti code!\r\n\r\nNDepend can help with this.\r\n\r\nIn this talk I will show you how to use NDepend to effectively visualise your code, find the seams and break down that giant monolith into manageable pieces. And I will show you the kind of improvements my team at Page Up have been able to make with these techniques"
  },
  {
    "SessionId": "6e8fe029-de1d-47db-a7c4-65cf888bcd49",
    "SessionTitle": "Don't hate JavaScript, a deep dive into V8",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "You might be a fan of JavaScript, or simply hate it. If later is the case, you're just like me back in the 2000. But JavaScript is changing like any other language in a way that has proved we cannot treat it like before.\r\n\r\nTo spread the love, in this talk I will explain the mechanics of the new JavaScript engine (V8) and go through some jargon like \"event loop\", \"non-blocking\", \"callback\", \"asynchronous\", \"single-threaded\". JS is not scary anymore when you understand how it works.\r\n\r\nI think 2017 was finally the year of \"JavaScript on the DESKTOP\". But DESKTOP it is not what you think, it comes from Developers Enjoy javascript now even though it Sucked compared To Other Programming languages. Nailed the abbreviation, didn't I?"
  },
  {
    "SessionId": "fcc5c1ab-bdd3-46d8-9959-3fc0bc5840e2",
    "SessionTitle": "Event Sourcing, from ancient Mesopotamia to modern software",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Patterns are all around us, and in software, the design patterns we choose can give us the power of the ancient kings and queens. Event Sourcing is based on the idea that storing events as they happen is better than storing the current state. \n\nImagine having the power to rewind and replay events, to debug, to generate reporting, to go back to ancient history...  We’ll get up close and personal with Command Query Responsibility Segregation (CQRS), which gives us the bonus of scalability out of the box, we’ll be designing and architecting applications at scale, just like the grand cities of the past, in no time at all!"
  },
  {
    "SessionId": "01997cb0-dceb-4704-b1d7-7aa1e97dbce4",
    "SessionTitle": "Five reasons to learn functional programming with Elixir",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Proponents of functional programming sometimes say that it requires you to “forget everything you know”. This can be extremely off-putting. And that is just one of the things that makes learning functional programming daunting. You might think it is too early or too late in your career to try to understand a whole new paradigm. Or that it’s all too much theory, or that lambda calculus is scary.\r\n\r\nI thought all of those things, but then I accidentally started learning Elixir. Elixir is a programming language with friendly syntax and good documentation. It is approachable, scalable, fault-tolerant and functional.\r\n\r\nThis session will cover Elixir’s powerful features, it’s approach to concurrency, and some of the popular open-source libraries that make it great to use. It will also present functional programming as a set of problem solving strategies and discuss why they are worth adding to your toolkit."
  },
  {
    "SessionId": "d95a3a34-5c01-4f59-b59c-48b29a62cb99",
    "SessionTitle": "Full Stack Rx - Using Redux Patterns on the Server Side with .Net Core, and SignalR",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Imagine you had something really important to tell everyone but weren't allowed to speak up until asked.\nThat's how all web servers and WebAPIs with their HTTP Request/Response cycle operate.\nSignalR, built on WebSockets, changes this client-server relationship from \"speak only when spoken to\" to a fully bi-directional communication.\nThis is amazing, but can also generate a lot of asynchronous events. Fortunately, we've got some great tools for handling asynchronous events....\n\nLike many developers, I first started using the Redux and Observable patterns developing client-side JavaScript / Typescript Single Page Apps.\nBut Rx and Redux libraries exist for many languages.\nThis talk explores implementing Redux behind a SignalR hub on an ASP.Net Core web server, adding predictable state management to the real-time capabilities of SignalR."
  },
  {
    "SessionId": "d5ff0735-dd69-4f34-9780-8e8e68e52710",
    "SessionTitle": "Further Adventures of the Event Loop",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Most JavaScript developers are probably familiar with the event loop. It’s how JavaScript handles I/O events without blocking, even though it’s single-threaded. Event callbacks are added to the task queue. The browser then takes a callback from the queue and runs it from start to finish. Then it decides to either repaint or run another callback. Simple, right?\r\n\r\nBut what about web workers? And promises? And what happens when your JavaScript isn’t running in a browser? In this talk, we’ll look at how multi-threaded event loops work, how promises differ from other callbacks, and what goes on in the Node event loop."
  },
  {
    "SessionId": "baf24144-51fa-415f-9cc0-0cdac0adf320",
    "SessionTitle": "Getting started with WinDbg",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "WinDbg is the most powerful debugging tool available on Windows. An austere UI, the lack of accessible documentation and tutorials make it challenging to get started. This session will focus on how you go from writing a memory dump on a production server to analysing this dump on your machine, explaining each step on the way.\r\n\r\nYou'll learn:\r\n\r\n- How to write a memory dump\r\n- The three key steps guaranteeing you'll be able to issue commands\r\n- How to troubleshoot crash, hangs and memory leaks"
  },
  {
    "SessionId": "e46e7ba0-6aba-43fb-99d5-9763c459ef12",
    "SessionTitle": "Go Back to the Future with Event Sourcing and CQRS",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Event Sourcing is an approach to building software with a long track record of success. By placing business concepts at the heart of our code, we can decouple systems into small services that can be quickly built, changed, and replaced. Although Event Sourcing has been around for many years, it remains outside the mainstream paradigm of software development–much to our detriment.\r\n\r\nWith Event Sourcing, we place the highest value on the simple capture of essential business events without attempting to interpret them. We can then relegate all interpretations of those events to subsystems that are easy to build, change, and replace when necessary. The resulting systems have single responsibilities and are decoupled from each other, which makes them simple to modify. Event Sourcing can enable us to move faster by supporting rapid experimentation with new perspectives, new user interactions, and new insights into our business.\r\n\r\nEvent Sourcing is agnostic of technology stack and language style, but it goes well with another pattern called CQRS: Command Query Responsibility Segregation. In this talk, we will do a deep-dive into both of these two patterns and discuss:\r\n\r\n* What is Event Sourcing, and how does it differ from systems designed around current state.\r\n* Interpreting Events into denormalised projections for very fast reads (Queries).\r\n* Receiving and validating Commands that, if successful, result in new Events.\r\n* Single responsibility services for reacting to Events by creating other events and, if necessary, triggering external behaviour.\r\n* We will cover the advantages of the pattern, to give us an idea for when and why it makes sense to use it. But it isn’t a silver bullet, and we will also talk about its disadvantages, including the most commonly mentioned downside: eventual consistency, and how we can deal with it."
  },
  {
    "SessionId": "d6782764-db2f-4725-ad3e-c7ee14b023ce",
    "SessionTitle": "Go Fast",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "I will show you how to build a Go microservice in twenty minutes. You will applaud its simplicity and marvel at its performance! There will be containers, there will be automation, there might even be tests! You will gain a notion of why you might want to use Go to do this."
  },
  {
    "SessionId": "2a15022c-1569-4c9a-90b5-9ba3d59d6b5e",
    "SessionTitle": "Going crazy with Docker multi-stage build",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Docker multi-stage build gives you a sequential pipeline of container execution with a final docker image generation of your application. Let's go crazy discussing multiple examples how to pre-build/template images for real life scenarios used in CI/CD pipelines, tests, and deployments. Including new Azure Container Registry feature."
  },
  {
    "SessionId": "59900fae-1f26-4161-9daa-69acc69e7656",
    "SessionTitle": "Graphic design for developers",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "The term 'programmer art' carries pretty negative connotations - basic, unattractive, and will eventually be replaced. But that doesn't mean that great programmers can't create great designs. In this session, you'll learn that with a few core principles and some free tools, even beginners can create appealing visual content."
  },
  {
    "SessionId": "d917d293-81da-47ea-b825-8e2339eb50d9",
    "SessionTitle": "Haskell - A Peek Inside the Ivory Tower",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Functional programming is becoming more and more popular and is starting to penetrate mainstream software development. You may have already used languages and libraries that support a functional programming style. But one language stands out as the epitome of functional programming: Haskell. What is it about Haskell that makes it a pure functional programming language? What features does it provide that can help us write quality, maintainable software? How can Haskell give us the confidence to safely refactor and change our software over time?\r\n\r\nIn this talk we'll take a tour around the Haskell language and see what makes Haskell an all-in functional programming language. We'll look at both Haskell's strengths and its weaknesses. We'll look at what sets coding in Haskell apart from coding in languages like F#, or coding FP-style in languages like JavaScript. We'll also dispel the myth that Haskell is not suitable for \"normal\" software. By the end of the talk, your peek inside Haskell's ivory tower will hopefully entice you to explore its potential further."
  },
  {
    "SessionId": "2365d4f0-51fe-4a0f-84bc-ef769c349d4d",
    "SessionTitle": "Honing Your Most-Used Tool: Your Keyboard!",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "You use it almost every hour every single day of the week, but have you ever really taken much notice of your keyboard? It might not seem like much, but using the perfect keyboard can make every day just that little bit nicer, and even help prevent common injuries.\r\n\r\nIn this session we'll cover how you can design and build your very own mechanical keyboard. From choosing your parts to programming your unique layout, we'll see what makes it such a fun and rewarding project. You deserve it!"
  },
  {
    "SessionId": "ab611921-8c48-4f75-9c8a-e22579c5f1c7",
    "SessionTitle": "How Microsoft does DevOps",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "This is NOT a session about MS DevOps tools. This is the story of how the VSTS team transformed from shipping an on-premise server product every couple of years, to shipping a cloud service multiple times a day. In the process, almost everything about how this team of 800 people work has changed. \n\nWe had to figure out how to do agile at scale, how to transform into a microservice cloud architecture, complete restructure of teams and roles, threw out a suite of 10’s of thousands of tests and started over, went from almost 0 telemetry, to 8+TB/day and figuring out to do anything meaningful with all that data. Many mistakes were made along the way, and lessons learned that I’ll be sharing."
  },
  {
    "SessionId": "7d65bb6d-2f8a-429f-9bb8-25f206f716f1",
    "SessionTitle": "How one team built their first microservice",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Microservices are here. But you're still stuck in a monolith. This is one team's story of how we decided to stop contributing to a shared monolith and start building our own microservices.\r\n\r\nFrom why we chose dotnet core, AWS, Docker, Terraform and Dynamo to the business context that drove and enabled us to build a microservice, I'll talk about our choices and experiences. Most importantly I'll tell you what we would have done differently if we had our time again."
  },
  {
    "SessionId": "d9f7ced4-7820-4afd-94cd-8e328a0b5f94",
    "SessionTitle": "How to Build a Number Plate Recognition Service using Microsoft's Cognitive Services",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Tired of seeing contrived demos of various AI technologies at conferences? In this session we'll take a real world problem of vehicle identification and apply the latest from Microsoft's cognitive services to solve the problem. \n\nFrom toll booths to parking inspectors, the challenge with automated vehicle identification is being able to successfully extract number plates information from an image. \n\nIn this session you'll learn about Microsoft's custom vision and OCR services and how they can be trained, deployed and combined as a Logic App in order to deliver an Azure Function capable of vehicle identification."
  },
  {
    "SessionId": "69b12845-4caf-4369-a3c2-103ba7f7f2d2",
    "SessionTitle": "How to raise a client",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Babies cry a lot and aren’t easily reasoned with (stay with me, I’m going somewhere this this). Occasionally clients can resemble these little humans. However, instead of showing them the same care we fall into the trap of considering their feelings tedious, stupid, or irrelevant.\r\n\r\nThis talk centres on discovering what basic needs clients want met. As Head of Customer Solutions, I have experienced several situations of unhappy clients. Occasionally I handled it well, other times, unfortunately, I didn’t. Learn from my mistakes with this light-hearted take on finding what your clients’ basic needs really are."
  },
  {
    "SessionId": "6d165284-fc1a-404a-a4be-31a00bf8b702",
    "SessionTitle": "How to waste your optimisation efforts",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "You spent  hours shaking all the trees, shaving 20kb off JS bundles. You ensured gzip is enabled, all code is minified. How would if feel if one image undid all that work, 10x over.\r\n\r\nImages are the real cause for concern when you talk optimisation. I’ll run through choosing the best type of image, ensuring it’s the correct size and  compressed.\r\n\r\nEnhance your optimisation efforts, by including these image techniques."
  },
  {
    "SessionId": "94bc9e16-2b15-4170-b7a7-7ae8e8f7bfd0",
    "SessionTitle": "Human Centered Design for Dummies, I mean, Developers",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "\"Design Thinking\" and \"Human Centered Design\" have been getting a lot of attention lately. So, what are they, and how are they even relevant to developers? Isn't this something just Designers with a capital \"D\" use?In this session, I will answer these questions and dive deeper into Human Centered Design. \n\nI will also provide you with enough information, resources, and a set of tools/techniques so you can pretend to be a seasoned Human Centered Design Practitioner in just 45 minutes. To get good at HCD will take you longer, but at least you have a starting point..."
  },
  {
    "SessionId": "31dc18c0-fca3-4bec-b0b9-f97fc1496eaa",
    "SessionTitle": "Implementing Augmented Reality (AR) in Apple's ARKit",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "In this session you'll learn how to implement Augmented Reality using Apple's ARKit. You'll be introduced to the ARKit framework and learn about harnessing its powerful capabilities for positional tracking and scene understanding. \n\nWe'll also look into its seamless integration with SceneKit and SpriteKit, and understand how to take direct control over rendering with Metal 2."
  },
  {
    "SessionId": "7566ec04-8ff4-4371-ac3c-d52500a1b980",
    "SessionTitle": "Importance of doppelganger in the cloud",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "From watching a tv series full of doppelgangers and vampires to learn how to design and implement a geo-replicated Azure cloud infrastructure. \r\n\r\nIn this session, I will go through my experience and lesson learned in one of my last Readify gigs to achieve solution resilience against vendor outages."
  },
  {
    "SessionId": "cdf5b780-da50-4cfb-9df9-548bfa20fb61",
    "SessionTitle": "Impostors and Inclusivity",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Impostor Syndrome is an ongoing systemic problem in the technology sector. \n\nThis talk focuses on the challenges faced by those who experience Impostor Syndrome and looks at ways we can, as a community, combat the elements of our industry that foster impostor feelings in those who are made to feel othered by building a more inclusive and supportive environment."
  },
  {
    "SessionId": "0bbcea42-04ab-4871-a786-b3d18cd7f094",
    "SessionTitle": "Information overload! A guide to better and more meaningful digital communication",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Email. Slack. Skype. Trello. Jira. Ping! Ping! Ping! Notifications popping up every few minutes... Inboxes full... Icons showing unread messages, calling for attention!\n\nHow can you stay on top of all the noise, and still manage to get some coding done? \n\nHow do you prioritise what messages to respond to? \n\nHow do you make sure you're not contributing to information overload of your colleagues?\n\nFind out how to manage the distractions inherent in our always-on digital lives, how to communicate more effectively using the tools we all love (and hate), and ultimately communicate in a more meaningful and productive way."
  },
  {
    "SessionId": "77f6099a-2e2d-4918-8f52-7d015536595b",
    "SessionTitle": "Infrastructure-as-Code on Azure Resource Manager",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Azure Resource Manager (ARM) provides a powerful set of tools for building Infrastructure as Code solutions - the unsung hero of automation in the PaaS world.\r\n\r\nLike any technology though, once you get past the 101 examples from the documentation, things start to get a little messier than the pretty picture in the brochure. \r\n\r\nIn this session we'll start with the basics, and then move on to a more complex architecture, orchestrating multiple different types of resources to reliably deploy full environments from scratch. We'll talk about some of the ways ARM solutions can get out-of-hand as you build out more complex infrastructures, and approaches you can use to keep things in check and maintainable for the long run.\r\n\r\nYou don't need to have any ARM experience, but it will definitely help as we'll move pretty swiftly through the entry-level bits. Some hands-on experience with Azure or AWS is highly recommended."
  },
  {
    "SessionId": "477ef693-139e-47ea-bad4-45a75aad1340",
    "SessionTitle": "Ingesting, Processing, and Analysing Events in Real-time at Scale",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Gone are the days of waiting weeks, days, hours or even minutes to report the insights on your data from systems and, in some cases, devices. \n\nModern data processing techniques like the Lambda Architecture help us design systems to handle millions of events by taking advantage of stream and batch processing techniques. \n\nThis helps us deliver much more real-time analysis and fault detection, while giving us the ability to implement batch-processing that help us analyse and predict trends based on the data streams. \n\nIn this session we will dive into an implementation of this architecture and have some fun with a tiny experiment while on stage."
  },
  {
    "SessionId": "dad598cf-4829-4834-986b-145cd1c807be",
    "SessionTitle": "Integration has never been easier!",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Want to connect new apps with other existing apps or legacy systems? Luckily, integration now is easier (and cooler) than ever. Learn how to use Azure Logic Apps and the Azure Integration Services suite to build robust and flexible integration solutions and connect to anything!"
  },
  {
    "SessionId": "247f0452-a9cf-4867-bef3-2112e9931886",
    "SessionTitle": "Intro to Machine Learning",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "What exactly is machine learning? And more importantly, will I understand the answer without doing a Masters and a PhD? Sure!\r\n\r\nJoin me, a fellow AI/ML-newbie, as I walk through what machine learning is, how it can be applied in your applications, and how you can actually create predictive models without accumulating a massive HELP debt in the process.\r\n\r\nWe'll start at the basics by talking about what machine learning can and can't do, but by the end, we'll have a working example of something actually usable. Chock full of examples and a totally non-scary amount of maths, this is the session for you if you're new to ML."
  },
  {
    "SessionId": "4cb6103b-7b43-4ca1-85dc-8527b495ad30",
    "SessionTitle": "Introduction to the Voice-centric Future of Interaction",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Soon it will be hard to imagine a world without voice first interaction. Whether your on your smart phone, using an Amazon Echo, or Google Home, we are beginning to see voice first devices ubiquitously enter our homes. \n\nVoice development is not only a study of language design, but also for many, a feat for accessibility. It encompasses many data science topics such and machine learning and is a step towards achieving artificial complete intelligence. \n\nJoin me as we explore the ecosystem that is Voice, the future of this emerging technology, and shows you how to get started developing your first app. If you're interested in developing on voice applications then this talk is for you."
  },
  {
    "SessionId": "a14c31c0-f9bd-4e1a-aaad-43d43d33af4c",
    "SessionTitle": "It's not all magic - clearing the mist caused by the cloud",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Cloud provider marketers like to tell us that the cloud is all magic. That we can provision resources, deploy our application and everything will be up 99.99% of the time. Is this completely true though? \n\nJoin me as we read between the lines of your cloud terms of service and what you can do to better understand what is needed for highly available, scalable applications."
  },
  {
    "SessionId": "37190ddc-e0a3-4ee5-8bc3-b5844a4ae8d8",
    "SessionTitle": "Lessons Learnt – Infrastructure as Code with ARM Template Best Practices",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Believe or not, if you use Azure cloud, you have been using ARM templates explicitly or implicitly. What exactly do ARM templates do? How can we use them properly as DevOps engineers? We use ARM templates in many different ways and not all of them are considered as \"Best Practice\".\r\n\r\nARM template is a very convenient tool to manage Azure resources. But at the same time, it is very difficult to manage and time consuming, unless it is efficiently written.\r\n\r\nAt the end of this session, audiences will have ideas of 1) how to manage ARM templates in YAML, 2) what the best practices using ARM templates are, 3) how we test ARM templates before deploying, and 4) how we proactively manage ARM template deployment history."
  },
  {
    "SessionId": "5b7facc8-f581-432e-a95f-1738f1095fd4",
    "SessionTitle": "Lets build an Alexa skill with .Net Core",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Unless you have been living in a shell you must have heard about voice assisted home devices like Amazon Alexa or Google Home that perform tasks controlled through your voice. These devices are becoming popular than ever and Amazon echo was launched in Australia just a few months back.\n\nIn this fun talk I will bring a Echo Dot device and you will \n\n* Learn the fundamentals of Alexa to build conversations.\n* Build a simple Alexa skill using AWS Lambda and .Net Core."
  },
  {
    "SessionId": "d039661c-91c7-4203-b26e-ae91cac848a0",
    "SessionTitle": "Let's Build an IoT Solution in 10 min",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "The field of IoT is exploding with the number of IoT devices expected to reach 25 Billion by 2020. There are great opportunities for developers to get into the field and experiment with IoT solutions. \r\n\r\nBuilding an IoT solution could be quite challenging because of the massive volume, high throughput, and vulnerable security landscape in IoT environments. In this talk, we will look at: \r\n- What are Microsoft Azure offerings for IoT? \r\n- What are the common hardware components to get you started? \r\n- How can we accelerate building and deploying IoT solutions? \r\n\r\nFinally, we will also demo building an IoT solution using MS Azure IoT Central. This should take less than 10 min. Hopefully you get to learn more by seeing rather than just by hearing, so it sticks :)"
  },
  {
    "SessionId": "a70aeeca-ed19-4635-85e7-93527edd825b",
    "SessionTitle": "Let’s face it, facial recognition is in your face",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Facial recognition technologies are integrated into various products and solutions:\n\n- Facebook has the ability to automatically identify and tag people in our photos\n- Law enforcement and security companies can identify people in surveillance videos (video recordings as well as real-time)\n- Apple integrate Face ID into their iPhone X to authenticate a user\n\nThere are existing facial recognition APIs in the wild (such as Microsoft’s Face API and Amazon’s Rekognition). However, these APIs are a black box, where you pass in some input (e.g. photos), and magically get some output (predicting PresenterName of people).\n\nThis session will present an overview of how facial recognition systems work. Rather than using an existing API, we will instead explore a prototype that implements the core features. This will give us an opportunity to picture the pieces in the facial recognition puzzle, as well as provide some ideas for possibly implementing your own system (or at least understanding how the existing APIs work).\n\nTopics that will be covered include:\n\n- Basic facial recognition concepts and features\n- Explore a live demo of a facial recognition prototype\n- Analyse the core prototype pieces of the puzzle\n- Technologies used in the prototype\n- Identifying possible issues with facial recognition systems that can lead to poor results\n- Learning path towards implementing a facial recognition system\n- Useful resources, such as recommended courses, useful SDKs and links to source code"
  },
  {
    "SessionId": "4aa1ead3-df0a-4823-8c25-1e734c53911d",
    "SessionTitle": "Listen Like You Mean it",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Creating great experiences starts by getting to the heart of problems your users, colleagues and clients have. The secret to uncovering these problems is being a great listener.\r\n\r\nI will take you through the practical listening techniques I learned studying Behavioural Science and show to use them everyday with stakeholders and colleagues.\r\n\r\nYou’ll be able to immediately apply these listening skills and start having impactful conversations."
  },
  {
    "SessionId": "b250103d-0f8d-4183-995b-02d26e1192ec",
    "SessionTitle": "Live Coding: Emulate a 3 year old with an Amazon Echo",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Have you ever wished you could have a conversation with a 3 year old child, but all you have is an Amazon Echo? Well this is the talk for you!\r\n\r\nStarting from scratch this session will go from File -> New Project to a working simulacra of a small child running in Azure Functions and interacting with Amazon's Alexa service. We'll cover how the Alexa Voice Service works, how to setup and train a natural language model, building the WebAPI endpoint and responding to requests.\r\n\r\nIf you've never played around with the voice technologies then this talk will give you a run through from start to finish of what it takes, and how easy it can be. You'll be able to go back to work and immediately build your own skill, regardless of whether you own an Echo device or not."
  },
  {
    "SessionId": "4a9838d6-c975-4d25-bca7-f6f4aab09108",
    "SessionTitle": "Living on the Edge",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Edge computing is the way of distributing computational load in a solution (or a network). Edge and Fog computing are becoming popular and they present enormous opportunities for developers and businesses. Microsoft alone is spending more than $5B on IoT over the next 4 years. By 2020, there will be around 25 billion devices, many of which are capable of performing edge computing. \r\n\r\nThis presents a great opportunity to developers. However, the question that many developers ask is where to start? In this talk, we will look at:\r\n- what is Edge Computing? and where is it needed? \r\n- Edge Computing advantages and disadvantages? \r\n- How can we combine Edge Computing with cloud computing? \r\n- How can we design, build, and deploy Edge Computing modules? \r\n\r\nThis will be a session full of demos so you will learn by watching (or doing). Feel free to bring your computer if you like to follow along."
  },
  {
    "SessionId": "3d7afcb3-6a2f-4e24-a0f3-f44a58cd40cf",
    "SessionTitle": "Machine Learning First",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "In the near future Machine Learning will underpin every aspect of human-computer interaction. You should be designing new systems with cutting edge Machine Learning capabilities from the ground up. We will explore the implications of ML for the whole team, from user research to development. \n\nGet a grounded perspective on how ML is going to change the way we interact with computers as designers, developers and consumers. Machine Learning First is the next big shift in how we think about designing technology."
  },
  {
    "SessionId": "160a72fd-a0f2-4ee6-a0f1-6ef8bbc1e674",
    "SessionTitle": "Machine Learning with CoreML & Azure Cognitive Services",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Trying to decide between using a Cloud AI or Local? Now you have the best of both worlds. Custom Vision Service recently introduced classifier export with support for CoreML. \n\nYou can use the Cloud to build quality classifiers with very small training datasets and export those Models to be run locally on iOS devices. We'll show you how to can easily add real time image classification to your mobile applications."
  },
  {
    "SessionId": "768d780a-b8ee-4d58-b175-5802886fbd6b",
    "SessionTitle": "Machine Learning with TensorFlow Lite and ML Kit",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Machine Learning with TensorFlow Lite and ML Kit\r\n\r\nBuilding your own AI models with transfer learning is really hot right now. \r\nJoin me, a fellow beginner in AI/ML, in this session for an introduction to TensorFlow and TensorFlow Lite and get started building your own custom models. \r\n\r\nWe'll start by exploring base models for transfer learning and extend them to meet our app requirements.\r\nWe will deploy our model locally on the device and also host it in the cloud with ML Kit.\r\nIn the end we will have a mobile app that performs real time classification.\r\n\r\nThis session assumes no previous knowledge and will present simplified examples with a small amount of code."
  },
  {
    "SessionId": "aef97d82-8ec1-4d6a-baa3-0fbf1a7dfae5",
    "SessionTitle": "Make your serverless APIs last with Durable Functions",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "You might have been told that APIs are meant to be stateless and finish their job fast. But what if you need to implement long-running or more complex asynchronous workflows on your APIs? \n\nLearn how you can implement serverless and stateful workflows with asynchronous APIs using the brand-new Azure Durable Functions."
  },
  {
    "SessionId": "624dbe16-e07b-4c13-aa99-00981b5d1dfb",
    "SessionTitle": "Map data visualisation: your first 1,000,000 dots on a web map.",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Making web maps doesn't suck any more. If you know Javascript, you can make high performance, highly interactive map-based data visualisations. \n\nYou'll learn the absolute bare minimum you need to know about spatial data (not much!), how to get your first dots on a map - and then, how to add a million more. We'll even cover how to self-host your entire spatial data infrastructure, using just two commands. \n\nFinally we'll show how to turn plain dots into compelling data visualisation with ridiculously snappy user interaction. We'll use Mapbox-GL-JS, a free, open-source library with excellent documentation, and a couple of related tools."
  },
  {
    "SessionId": "deca6775-b815-4af6-8b9f-16cd94a855af",
    "SessionTitle": "Migrating a team to Git and Visual Studio Team Services",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "How does a team successfully move from an internally-hosted centralized version control system to Git running in Visual Studio Team Services? \n\nHear how one group of developers did this by taking along the people, adapting their processes, embracing the technology, in a culture open to change.\n\n* How did we transition the team and learn the new tools and processes?\n* What did the team do to maintain version history after the change?\n* Do you have to be \"all-in\" on VSTS? Actually, no. Learn how we integrated our other development systems with VSTS\n* Why did we want to move, and have we realised those benefits?\n* Where to next? Are we satisfied with what we've achieved, or are there new goals to aim for?"
  },
  {
    "SessionId": "4787c0dc-5aa1-4e17-b0de-f14294a33fb5",
    "SessionTitle": "Modern JavaScript For Web Dinosaurs",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Back in the day, you'd roll out some jQuery and build websites with the best of them. But nowadays terms like \"Webpack\" and \"React\" and \"Node\" kept cropping up, and the new code you see looks nothing like the JavaScript you thought you knew... Uh oh - you've become a web dinosaur!\r\n\r\nIf you've been out of the game for even a little in frontend development it can be a huge trial to get back in. In this session I'll take you on a trip from basic jQuery all the way up to React and explain how we got from Point A to B. It'll be packed with examples - so not matter what year your JS knowledge is from, you'll walk away feeling less like an extinct dinosaur and more like a state-of-the-art web developer."
  },
  {
    "SessionId": "d5bfc25b-f8c6-4762-8d62-89efe3176456",
    "SessionTitle": "Modern Testing for Modern Developers",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Just like development tries to move away from ineffective and inefficient approaches, testing has evolved since the days of heavyweight, formal test cases, and large test teams working in isolation. Testing is no longer the exclusive task of testers, but instead is becoming a whole team responsibility, perhaps with the assistance of a test coach.\n\nAs such, developers need an understanding of modern test techniques, and how they can use them across the development lifecycle. These include exploratory testing, using customer risks to drive your testing, and what to invest your human test effort on in a world where you automate everything\n\nAt the end of this talk, audience members will have an understanding of, including applications and benefits of:\n\n* Manual, human testing\n* Risk-based testing\n* Exploratory testing\n* Automated testing\n* The benefits of all these, and how these can all be used together in waterfall, agile and DevOps environments"
  },
  {
    "SessionId": "3ab3ea9f-59eb-42af-b253-0c97a17701d9",
    "SessionTitle": "Moving from App Services to Kubernetes with AKS",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Azure Kubernetes Services is a game changer for Enterprises. I am going to compare App Services with Kubernetes(Containers) to show how AKS is bringing a powerfull alternative to App Services. Including all existing tools available for developers."
  },
  {
    "SessionId": "7b6fad37-b9d1-46ce-8b73-ea32dc6b55b8",
    "SessionTitle": "My job as a software engineer is not to write code",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Many software engineers are lead into the false assumption that we are hired to write code.\r\n\r\nThis talk challenges that perception and discusses the real reason we are paid to turn up to work every day.\r\n\r\nMy belief is that it's important for developers to realize that, as it helps inform their decision making."
  },
  {
    "SessionId": "fd1ef7e9-fdbb-4a0a-b683-866d72727a04",
    "SessionTitle": "Naming things is hard: Interface writing for developers",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "We know that naming things is one of the two hard things in computer science (https://martinfowler.com/bliki/TwoHardThings.html), but it’s important to get the words in your interface right. Like good design, well-crafted content can prevent problems before they happen and make a huge difference to the user experience of your product.\n\nIn an ideal world, we’d all have a UX writer or technical writer in our team to come up with button text, field labels, error messages and other microcopy. But more often than not, developers have to do it themselves. I will share some tips on putting the user first, making every word earn its place and cutting the jargon to help developers create clear, concise and helpful interfaces."
  },
  {
    "SessionId": "f73ee5db-6b92-4732-b50c-bd4103be618f",
    "SessionTitle": "Need for speed 8, performance tuning of your web application",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Do you believe that more than 80% of web traffic in China comes from mobile devices?\r\n\r\nWe live in an era where people don’t bother opening their personal computers for browsing anymore. Because of this, the performance of the website or web applications has never been more important.\r\n\r\nJoin me in this talk and we will go through what I do to speed up the applications I work on, why I do it, and the tools I use to optimize front-end performance. We will look at minimising requests, using resource compression, page rendering and some other techniques which are crucial to consider for fine tuning your applications’ performance.\r\n\r\nIt is going to be fun and I am sure you would take home some tips and tricks to keep you busy for a while, and once applied, you start hearing some wows and awesome feedback."
  },
  {
    "SessionId": "5ec31307-53f4-4c57-8f4c-8a54cf62b4f4",
    "SessionTitle": "New features of MSBuild and NuGet for all",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Big changes have been happening with MSBuild and NuGet. Things are getting simpler, and it's not all just for .NET Core either! In this talk you'll see how you can update .NET Framework projects to take advantage of the more concise project files, simplify NuGet packages with transient dependencies, and even target multiple framework versions.\r\n\r\nLearn about common pitfalls, tips to diagnose problems and strategies for working with mixed solutions combining the old and new formats."
  },
  {
    "SessionId": "70556f46-5a9d-41c2-8b8c-391b1d24b6a7",
    "SessionTitle": "NoSQL concepts capsules",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "With the NoSQL buzz word being around these days, we use it quite frequently but we miss the basic concepts behind it. So, don't fall into the same hole again and use database as a data store without understanding the concepts behind. \r\n\r\nIn this session, I will give you the NoSQL concepts capsules that you will never forget and will help you choose the right one for you and use it effectively."
  },
  {
    "SessionId": "171e0bbc-ff98-4e67-97a3-69bd86e2d9e5",
    "SessionTitle": "Overview of Azure Hybrid Integration tools",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "We will look at the different tool in Microsoft Azure that can help you deliver on the promise of a truly Hybrid Integration strategy for your company. It will not be a deep look at any one service by more how the services can work together to delivery Hybrid Integration."
  },
  {
    "SessionId": "8ea6cb75-ba00-4e45-9db2-e1154d2e2f41",
    "SessionTitle": "Polling is Evil, Designing Event Based Integration Solutions",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "With the recent GA of Azure Event Grid and the announcement CloudEvents, I will look at how a typically Integration Solution can take advantage of Events over Polling.  I will also demonstrate how to use existing Azure Event and how to create custom events for both Event Grid and CloudEvents."
  },
  {
    "SessionId": "c83db75a-e812-43c5-a167-4d050c6377e1",
    "SessionTitle": "Pragmatic Performance: When to care about perf, and what to do about it.",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "As a developer you often hear both that performance is important, but also that you shouldn't worry about performance up front, so when is the right time to think about it? And if the time is right, what are you actually supposed to do?\n\nIf you're interested to hear about a pragmatic approach to performance, this talk will explain when is the right time to think about benchmarking, but more importantly will run through how to correctly benchmark .NET code so any decisions made will be based on information about your code that is trustworthy.\n\nAdditionally you'll also find out about some of the common, and some of the unknown, performance pitfalls of the .NET Framework and we'll discuss the true meaning behind the phrase \"premature optimization is the root of all evil\"."
  },
  {
    "SessionId": "b49d98cf-8378-4af9-a5a7-e063ec36f673",
    "SessionTitle": "Presenting SVG Graphs",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Graphs are a great way to visually show a large amount of data. From dashboard page graphs showing how many people have done the thing, to telecomm websites showing how much data you've used recently. They are everywhere.\nHowever they can be quite challenging to program well, they push the limits of what front end technology can do, as it's much more comfortable showing the data in a table thank you very much!\n\nI'm going to show a way to make graphs on a website a slightly different way then you may have seen in the past. A way that uses a back end language (such as Ruby but could be anything really) to calculate and draw a graph on the front end in an SVG element, using CSS for styling (no JS required). You control all the calculations and where everything goes and how customisable it is.\n\nMy hope is that after this talk that you will feel more confident about making something like this for yourself and also learn a bit about SVG's which you may not have known before."
  },
  {
    "SessionId": "6e810243-1d4b-4b38-a23a-a77ff56c3c66",
    "SessionTitle": "Progressive Web Apps, getting close to Nirvana",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Let’s talk about the progress of web apps. No, that’s not an autocorrect mistake from “progressive web apps” — let’s take a look at how the web has progressed from “a large universe of documents” to a universal application platform.\r\n\r\nIn this talk we will have a look at how far we've come in web development and how close we are to be independent of platform specific languages and tools.\r\n\r\nWe will also convert a web application to a PWA and evaluate it's performance along the way. It is going to be fun, so happy voting..."
  },
  {
    "SessionId": "4fa335ae-f910-4df8-9037-d6eb6738d448",
    "SessionTitle": "Railway Oriented Programming: C# Edition",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Do you ever feel dirty when adding if statements and try catches to your code to handle basic errors, catch exceptions and/or log events?\r\nMaybe your code started off as a few basic lines but then blew up into a nested mess of branches after you handled every expected error. \r\nOr maybe you're envious of your functional programming friends and want to learn something new?\r\n\r\nWe've already seen the introduction of functional programming techniques when it comes to lists and events in procedural languages.\r\nIn this talk, I'll show you another technique functional programmers use to handle errors and how you can apply it yourself.\r\n\r\nPopularised by Scott Wlaschin on his site F# for fun for profit. I bring the concept to C# with practical examples and an easy explanation\r\nwithout the functional jargon. This technique has been battle tested and I'll gladly share the pros and cons as well as solutions to common situations you may face.\r\n\r\nBy the end of this talk, you'll be able to streamline your code to write clean, happy path programming where the business objective can be quickly understood."
  },
  {
    "SessionId": "f4f85a80-256b-40c4-bedb-fe9d6e520a02",
    "SessionTitle": "Ransomware 0, Admins 1",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Ransomware made headlines in 2017, with attacks shutting down the UK's NHS and costing Maersk shipping over $300m in lost revenue. Ransomware is a massive business for cybercriminals, driving the cost of bitcoin from $1200 to over $7000 per coin. \n\nWe often see ransomware as some unbeatable force, however with some common sense controls and simple tricks, the damage can be reduced or even stopped.  Join me to learn some simple, free steps you can do to stop ransomware in its tracks."
  },
  {
    "SessionId": "c9718bbf-9fdf-46b4-b6e2-8dbba5766654",
    "SessionTitle": "Real-Time Analytics with Power BI",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Power BI helps you build appealing visualizations of your data. With ever growing footprint of data it is equally important to get real-time insights into your data. It can be as simple as monitoring a single metric or viewing real-time sales performance across multiple locations. Power BI real-time streaming enables you to stream data and update dashboards in real-time. Any time sensitive data can be a source of streaming data set like IoT sensor devices, social media sources, service usage metrics etc.\r\n\r\nIn this session \r\n1. I will dive deep into real-time analytics with Power BI.\r\n2. How to build streaming tiles in Power BI Dashboards.\r\n3. Demo using Power BI REST APIs.\r\n4. Demo using Azure Event Hub and Azure Stream Analytics."
  },
  {
    "SessionId": "611da509-b7a5-4023-9e0c-90425134f811",
    "SessionTitle": "Real-time communication apps and sites with ASP.NET Core SignalR",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Have you ever wanted to create a real-time communication application?\r\n\r\nASP.NET Core SignalR allows you to create applications that do just that. It's great for chat apps, collaborative data editing apps like sketching whiteboards or editing the same data record, or apps that need to notify your users of important events quickly.\r\n\r\nIn this session, you'll learn how to create an ASP.NET Core SignalR project. You'll learn about Hubs and optimising your connection with MessagePack. We'll finish with showing you how you can run it from the new Azure SignalR Service. \r\n\r\nNot only will you connect to your service from using ASP.NET Core views using Javascript and Typescript, we'll show how you can support mobile and desktop apps."
  },
  {
    "SessionId": "96f1c870-bf5f-449d-ace0-6d5d57e175a0",
    "SessionTitle": "Reducing social media helped me become a better developer",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "In a dopamine driven world getting your next 'hit' can be easily done on social media and this can cause you to lose focus. On social media people from a diversity of backgrounds advertise their filtered life on social media and this can cause some negative impacts on their followers, even if they are not aware. \n\nWe all have problems in life: family, financial, or legal. However posts on social media are often filtered so that the best things are shown. This is my story of how I became a better developer, a better listener, and did more with myself by reducing social media."
  },
  {
    "SessionId": "c4281182-5c61-4bfb-8e28-080816af5f1c",
    "SessionTitle": "Running you ASP.Net Core App on Azure Kubernetes Service (AKS)",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "If you haven't heard already  Microsoft Azure Azure Kubernetes Service (#AKS) is now generally available inlcuding in Australia-East region. AKS is a managed Kubernetes service on Azure that simplifies building, deploying and running containerised apps on a Kubernetes  cluster. This talk is aimed at developers who want to taste AKS.\n\nIn this talk I will \n\n* Briefly describe the architecture of AKS\n* Create a Kubernetes cluster on Azure and walk through some of the  features AKS offers.\n* Demo showing how easy it is to deploy a ASP.Net core application to AKS from visual studio."
  },
  {
    "SessionId": "29c586a6-a046-4329-bd03-b6f9c0acb974",
    "SessionTitle": "Rust for the Scala/Java/JVM developer...and everyone else!",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "For some developers (including myself), much of our work has been within \"safer\" environments, like the Java Virtual Machine (JVM). Environments like these have, with good reason, protected us from things we may have not needed to deal with in a long time—for example, error prone OS-level memory allocation and de-allocation. They have also made it in some respects easier to make our software widely available and executable; in the case of Java, the \"write once, run anywhere\" adage continues to serve its purpose, but probably more conditionally than originally thought. In any case, there continues to be a need and desire to write code for places where the JVM can be restrictive, inefficient, unavailable, or simply inappropriate. Fortunately, there exist alternatives that allow you to write code at a more native level without the need to lose all of the benefits that platforms like the JVM provide. One of those alternatives is Rust.\r\n\r\nIn the last few months, I've been exploring the Rust language as both another \"tool on my belt\" and an alternative for writing software. It is not a new language, but more recently, it has fast become a widely adopted language for a multitude of uses, including those based on the limitations I briefly described above. Quite early on, I learned to appreciate the simplicities of the language. However, more importantly, I initially realised that Rust shared common traits with some of the languages I use daily—mainly Scala and Java. In my opinion, those commonalities make it a desirable stepping stone language for people exploring the need to write software outside the JVM and/or more natively. After giving a brief \"nutshell\" introduction of Rust, the majority of the session will discuss a number of syntactic and functional comparisons that I believe could help determine if Rust is the language you want to learn next."
  },
  {
    "SessionId": "283b1349-c00d-43a5-b608-80946b8dccab",
    "SessionTitle": "Secure Azure Deployment Patterns",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Microsoft has provided an almost unlimited number of ways for you to securely deploy Azure resources; but people continue to make simple mistakes. In 2017 many organisations had breaches due to poor cloud deployment practices.\r\n\r\nIn this session, you’ll learn how to use Azure Resource Manager (ARM) templates to deploy resources in a secure manner. This session will look at Azure Storage, App Services, SQL, Virtual Machines and Virtual Networks. I'll discuss the costs, benefits and trade-offs of different design patterns and how you can secure your deployment pipelines."
  },
  {
    "SessionId": "c28761b5-cb4c-4abb-9a74-ac8129203e85",
    "SessionTitle": "Securing Single Page Applications",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "We’ve been spending more and more time developing applications that run in the browser, Single Page Applications, SPA's, and more recently Progressive Web Applications, PWA’s. But with more code running client side what changes do we need to make to how we write applications, test applications and secure applications?\r\n\r\nSo how do we write a secure SPA? What do we do with our security tokens, client-side data, track vulnerabilities in our dependencies or implement trust between the client and server?\r\n\r\nIn this talk, we'll deep dive into some practical solutions on how to create secure modern web applications."
  },
  {
    "SessionId": "baed0437-b817-4ff5-8bc1-0ac10ee7307c",
    "SessionTitle": "Service Meshes - Powering the next wave of microservice architectures",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Microservices and containers have transformed application design and deployment patterns. Modern cloud native architectures - which underpin many of the world's groundbreaking tech companies such as Uber, Netflix and Airbnb - afford unparalleled levels of agility and scale but are not without trade-offs. In applications comprising hundreds of services (and thousands of service instances), concerns such as security, operability and observability pose significant challenges. Supporting compensating capabilities such as circuit breakers, retry policies and service discovery in each microservice adds undesirable code bloat and impacts our ability to choose the best language for the problem at hand should the required libraries not be available. \r\n\r\nIn this session, we will take an in-depth look at the service mesh pattern; the benefits that a decentralized microservice management approach brings; the best practices that have evolved; and most importantly what you need to know to effectively leverage a service mesh in your architecture:\r\n\r\n- How to determine the suitability of a service mesh for your application context. Don't just drink the cloud native Kool-Aid!\r\n- Disambiguate the overlapping responsibilities of an API gateway and service mesh in a modern architecture and demonstrate how they can be used in harmony.\r\n- How a service mesh enables choosing the best tool or language for a given service without being constrained by the availability of libraries for each platform. Effectively it's a weight loss plan for your microservices.\r\n- What techniques to apply when transitioning to a service mesh based architecture.\r\n\r\nAdditionally, we will take a hands-on look at what is involved to build and manage a microservice architecture leveraging Kubernetes and Istio, a leading open source service mesh. By the end of the session, you will not only understand the concepts underpinning the service mesh pattern but also have the knowledge to put them into practice."
  },
  {
    "SessionId": "ab920c59-ced5-4756-9f1a-26fc7a05a660",
    "SessionTitle": "Service workers - beyond the cache",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Service workers are here to stay, they're live in (almost!) all the major browsers and all your favourite frameworks offer them out of the box for caching your application offline. This is a great start for building modern, resilient, progressive web applications. But only using the service worker's cache is like driving a sports car in 3rd gear at the most.\r\n\r\nWe'll dive into push notifications, background sync and other experimental service worker features, showing what they can be used for and how to integrate them in your app. Together we'll see how to make your web apps appier and your users happier."
  },
  {
    "SessionId": "65320ce8-e111-49dd-8696-d911a82e9abd",
    "SessionTitle": "Shaping the Internet with Terraform",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "How do you create your infrastructure in such a way that they are similar across regions, or accounts?  \n\nWhen it comes to infrastructure at scale, you can either use the AWS CLI and scripts, or you can use this neat little tool called Terraform, which will make sure you can deploy you infrastructure at scale, consistently and easily."
  },
  {
    "SessionId": "b59e8977-6a81-4a4b-b7e6-43527cdb717b",
    "SessionTitle": "Sit on your hand and throw away your mouse: Simple hacks for building more inclusive products",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Close to 1 in 5 Australians have a disability. That’s roughly 4.5 million people. But in the tech world, the people building the products and services often have little or no experience with disability. So how do we make sure we’re creating inclusive experiences that work for all people, no matter their level of ability?\r\n\r\nIn this interactive session, we’ll test out some ‘empathy prompts’ that will bring you one step closer to understanding how disabilities affect people’s experience with technology, and start you on a path towards embedding accessibility into your processes and culture. Bring an open mind."
  },
  {
    "SessionId": "6f86d2e1-b1f9-4c9e-a6f1-df6d14e2340a",
    "SessionTitle": "Start Your Career Right",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Starting off your software development career, especially if it's your first career, can be tough. There is so much to learn, more than just syntax of code! This talk, aimed at junior, intermediate or even senior developers(!) covers some of the key tricks to a successful career, such as finding a mentor, working in a team, finding direction, supercharging your learning, getting your performance reviewed and much more. \r\n\r\nThis talk covers a lot of topics, fairly quickly, and so there are many micro-takeaways, but the main takeaway should be “there is more to focus on than just code”. I think attendees would get a lot out of this talk, as it covers topics that people tend to learn the hard way, if at all. However, the knowledge in the topics can be transformative and really supercharge a transition from junior through to senior."
  },
  {
    "SessionId": "aec43249-6ad1-4c16-99d2-8f51fb0e3e4c",
    "SessionTitle": "Structuring epic ARM deployments",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Azure Resource Manager (ARM) - the unsung hero of automation in the PaaS world.\r\n\r\nIn this rapid-fire session, we'll run through some tips and tricks for structuring ARM templates and keeping things maintainable once you get beyond \"Hai Azure, plz create a WebApp kthxbai\". We'll convert those wastelands of undocumented JSON into a sane, sorted deployment system you'd take home to meet your mum.\r\n\r\nExperience deploying infrastructure with ARM templates will definitely help you understand the problems and appreciate the solutions presented."
  },
  {
    "SessionId": "19aa3d53-d810-4934-af49-f0ccfc749b9b",
    "SessionTitle": "Taking the leap into developing as a contractor",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "So how do you do it? How do you take the leap out from working for someone else, to running your own contracting business? Where will your first clients come from? How can you work efficiently and stay sane when working mostly by yourself?\n\nContracting and freelancing can be one of the most exciting and rewarding styles of working, and it can offer some of the best perks you could ask – freedom, flexibility, control over your own earning capacity, and project variation.\n\nIn this session, I will share my experiences from running my own freelance/contracting development business for the last 10 years, passing on tips and tactics to get started, keep going and make it the best decision you ever made!\n\nThe last 15 minutes or so of the talk will be dedicated to answering all the burning questions that you may have on starting your own contracting business."
  },
  {
    "SessionId": "11d8d483-dab0-471a-9ec9-0329cec9e760",
    "SessionTitle": "Taking the Noise Out of Distributed Systems",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "We're in the age of distributed systems. Micro-service architectures and cloud computing have changed the way we create and manage our applications. As a result, distributed systems have become a key architectural concern. \r\n\r\nWhile distributed systems give us access to enormous power, this comes at the cost of increased complexity. It can be hard to know where to begin. \r\n\r\nIn this talk I will explore a number of topics including distributed data storage, computation, and messaging, with a focus on foundational concepts and common challenges. Along the way we'll take examples from popular distributed system products."
  },
  {
    "SessionId": "a0edac30-c438-43fe-896f-6ee9d1f786c9",
    "SessionTitle": "Taming Asynchronous JS with Reactive Extensions",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "If you’ve ever struggled with managing async code or felt that Promises lacks essentials features like cancellation, better composition or in general are feature-poor, here comes the Saviour — Observables and RxJS."
  },
  {
    "SessionId": "bf073f3c-c131-44ac-8b14-09f5b8619cd7",
    "SessionTitle": "The beauty of stupid ideas",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "We spend all our days striving to write the perfect code, code that is well thought out and will stand the test of time.\r\n\r\nThis is not a talk about that code. This is a talk about all that code you don't write because it's stupid, it doesn't solve a \"real\" problem or doesn't make any sense.\r\n\r\nWe'll explore some of my own stupid ideas, like writing my own number system in .NET or writing an IoC container in JavaScript, what I learnt from these stupid ideas and why exploring stupidity is important."
  },
  {
    "SessionId": "77920952-0229-4430-bf7a-aee27323dd3d",
    "SessionTitle": "The Boring Security Talk",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Troy Hunt and Scott Helme have spoken about all the exciting security things, so let’s talk about the boring bits! When we think about application and infrastructure security, we often think about the big shiny things and forget the boring bits. \n\nIn this talk, we’ll look at the security of our package dependencies, CI/CD tools, how we send email and even resolve hostPresenterName. \n\nOver the last few months, hackers have managed to inject cryptocurrency miners into all these places. Security incidents in these components might not result in an entry in Have I Been Pwned?, but they'll result in a bad day."
  },
  {
    "SessionId": "0d3db25d-2136-43fd-8866-b67b01cab7e1",
    "SessionTitle": "The future of art: creepy, frivolous and beautiful art made with machines",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Most people are aware of the impact machine learning will have on jobs, on the future of research and autonomous machines, but few seem to be aware of the future role machine learning could play in the creative arts, in visual art and music. \n\nWhat will art be like when artists and musicians routinely work collaboratively with machines to create new and interesting artworks?  \nWhat can we learn from art created using neural networks and what can we create?  \nFrom the frivolous to the beautiful what does art created by computers look like and where can it take us? \n\nThis talk will explore magenta in tensorflow and neural style in caffe, google deep dream, next Rembrandt, and convolutional neural networks, generative adversarial networks and more. \n\nI will look into some of the beautiful applications of machine learning in art and some of the ridiculous ones as well."
  },
  {
    "SessionId": "b95768c3-8453-41a9-91dc-39b5ad47a322",
    "SessionTitle": "The People's Revolution in Development",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "You may have all the technical skill in the world, but you're only as effective as your ability to influence and understand people. \n\nIn this session, we will explore the human relationships that developers need to nail in order to be the most effective at their job. We'll cover some practical tips as well as enjoying some humour around people's behaviours and motivations."
  },
  {
    "SessionId": "d6a9e73f-ac71-4223-8502-c9a96e0bb1ff",
    "SessionTitle": "Thinkin' about WebAssembly, talkin' about Blazor",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "WebAssembly (Wasm)  is a binary instruction format designed as a portable target for compilation of high-level languages that can run in the browser. \r\n\r\nBlazor is an experimental web application framework out of Microsoft that provides the means to write a Single Page Application using Razor pages and C# running with Web Assembly.\r\n\r\nIn talk this we will first look at what Wasm is and its potential impact on web development.  Once we have that under our belts we will dive into Blazor and get a feel for the developer experience and how it stacks up against the current crop of web development frameworks/libraries."
  },
  {
    "SessionId": "12bdca97-f489-4191-914a-db1c763aa5b5",
    "SessionTitle": "This Startup Life: A Developer's Mistakes and Tips",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "It's been 552 days since I had the arguably dumb idea of trying my hand at a startup. Little did I know the sheer volume of learning I'd be doing in the future, from basics like cashflow and forecasts to life lessons like always be talking to new people. \n\nIn this talk I tell the story of how I went from a full time .NET Developer, to a struggling and then mildly successful startup owner. \n\nWe'll explore how I made the transition from full time employment to self-employment; we'll look at many of the mistakes I've made and how to avoid them; and we'll go through some practical tips to get you started on your own startup journey. My first tip? Learn from other people's experiences!"
  },
  {
    "SessionId": "24db184a-dc80-4a03-a355-c777df3d74d2",
    "SessionTitle": "To branch or not to branch... That's not really the question",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "How to branch though? That's a good one.\r\n\r\nThis critical aspect of developing software has massive impacts on your ability to have multiple teams working on the different parts of the same project in parallel.\r\n\r\nAs we're shifting from centralised version-control to decentralised, suddenly every developer's machine is a new branch.  Carrying over the same approaches from the centralised world is a pretty good recipe for a lot of pain. It could spell the difference between seeing your shiny new feature deployed and loved by customers, and it dying off in a lonely branch somewhere.\r\n\r\nIn this talk, we'll compare some of the most prolific branching strategies of today - where they're awesome, where they leave a bit to be desired, and where they're evolving to. We'll expect a working knowledge of source control systems and approaches, but you don't need to be a master of `git reflog` to follow along :)"
  },
  {
    "SessionId": "2daf0b51-77bd-44a9-84d3-658a27907114",
    "SessionTitle": "Travel light with Parcel JS and Vue JS",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "What will frontend dev be in 5 years? As Redux creator Dan Abramov says, we can only hope there will be less configuration. Instead of hoping, let's talk about how to get zero configuration today, using Vue JS and the Parcel bundler. \n\nFind out why more and more devs choose this stack over Webpack + React JS + Redux."
  },
  {
    "SessionId": "c75c3acb-2d25-4798-a61a-a4b34ed5532b",
    "SessionTitle": "Two platforms, one codebase: Experiences building a cross-platform React & React Native at Sportsbet",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Two years ago I joined a small team on an ambitious project at Sportsbet to re-platform separate web and iOS apps into a single codebase using React and React Native. Furthermore, we had to structure the project so that the team could rapidly grow to 20 developers and beyond. This is the story of why we did it, how we did it, and what we learnt along the way.\r\n\r\nI’ll start with a quick introduction to the app and why it was important to have a unified codebase. I’ll then move onto the different options we investigated for maximising code reuse, and how we settled upon an existing React pattern to give us a simple but highly-scalable solution. I’ll use an example app to demonstrate this pattern in action.\r\n\r\nNext, I’ll move onto how we dealt with the areas where web and native UX naturally diverge, and how we dealt with these differences. I’ll mostly be talking about navigation and routing here, but we’ll also explore animations as well. Again, I’ll aim to demonstrate some of my points with examples.\r\n\r\nFinally, I’ll delve into some of the sociological challenges that came up for us on such an ambitious project. This includes how we convinced Objective-C developers to write JavaScript (!), the places where developers commonly tripped-up when adopting React and React Native for the first time, and how we managed a behemoth cross-platform build, testing and deployment process with a rapidly growing team.\r\n\r\nAttendees will leave this talk with a better understanding of the strengths (and weaknesses) of cross-platform React codebases, how to structure such a codebase to maximise code reuse whilst still having platform-specific escape hatches available, and what you need to do to keep all of your developers productive as the codebase grows."
  },
  {
    "SessionId": "7ae413c5-1257-4166-8e6e-38b755cf95bf",
    "SessionTitle": "Using Serverless (Azure Functions) as a backend for mobile apps",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "How you can utilize the the serverless offerings from Azure/AWS to build scalable backends for mobile apps. Talking about my experience with building an app using serverless offerings from Azure (Storage & Functions). The pros, cons and what to look out for."
  },
  {
    "SessionId": "b7108d0e-bcfd-4738-b231-c1a380609373",
    "SessionTitle": "UX for Developers",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Everyone has great design ideas! (Seriously)! But not everyone has the vocabulary to communicate them. This session is for devs who are curious to learn more about UX Research and Design, so you can work more effectively and collaboratively with your design peers. \n\nJoin me for a crash course on UX terminology, methodologies and outputs, and we'll even squeeze in a few fun hands-on activities. Sharpen your sharpies, unbox the post-its, it's time to share the UX love!"
  },
  {
    "SessionId": "0f13a1b5-0a1a-4c58-a809-eeac5da3fc87",
    "SessionTitle": "UX of Mixed Reality (Augmenting our world)",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Welcome to the world of tomorrow! It’s time to say goodbye to flatland, where pixels are bound to our lifeless screens, and embrace a reality where our world is the platform. It is the medium and the message. This reality is where digital comes to life, gets cozy with all of our senses, and augments our daily experiences.\r\n\r\nThis session will introduce concepts key to designing MR experiences. \r\n\r\nNote: MR refers to Mixed Reality and encompasses Augmented Reality (AR), Virtual Reality (VR) and everything in between."
  },
  {
    "SessionId": "a998e88d-f451-4915-b1e6-6a8058c681f6",
    "SessionTitle": "Virtues and shortcomings of GeoSpatial Analysis",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "An established and growing area of I.T. are the GeoSpatial systems which sit behind the largest organizations in the world. I will be covering off use cases along with virtues and shortcomings of GeoSpatial technology in use with a focus on MapInfo Professional. \n\nEver wondered what a projection/ datum is and how longitude/ latitude work? Then look no further then this clear, concise and easy to understand presentation."
  },
  {
    "SessionId": "6d3e60f1-b653-482b-bcdf-f1e2e34033f9",
    "SessionTitle": "Web Application Security: Winning When The Odds Are Against You",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Even the simplest web application has so many vectors of attack, it’s no wonder most people forget at least one. Web applications aren’t stand-alone; they are built upon frameworks, upon platforms, upon core libraries, each of which could suffer from vulnerabilities you’re not only unaware of, you’re statistically unlikely to discover them all. Consider, for example, OpenSSL's infamous “Heartbleed” Bug.\r\n\r\nWe hear about security vulnerabilities every week, now it’s time to experience them. Find out what the leading concerns are, and the not so common ones too, and experience live demonstrations of how these attacks play out.\r\n\r\nThis presentation aims to arm you with the mindset, tools and resources to minimise the opportunities for attack, and to reduce the fallout when they succeed. From cross-site scripting and session hijacking to brute force and man-in-the-middle attacks, you’re expected to cover all your bases so the bad guys can’t use a single one."
  },
  {
    "SessionId": "2d8cd940-6f00-463e-8d99-54ddab96262e",
    "SessionTitle": "We've Updated Our Privacy Policy",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "It's 2018 more people are checking social media than watching the 6pm news. YouTube and Netflix are slowly overtaking the popularity of Television. Microsoft acquire for GitHub 7.5B and Mark Zuckerberg has been hit with lawsuits over data misuse. Equifax has arguably had one of the worst data breaches ever.\r\n \r\nIt seems with every growing year data is becoming worth more and more as the risks of data storage has increased. Have you stopped to think about what these companies can do with your data that makes them worth so much? Have you thought about why your privacy matters? Is your data safe or does privacy not exist anymore? \r\n\r\nIn this talk I hope to explore the answers to these questions and uncover some truths to what the potential to data collection could become.  If you're someone who blindly clicks *Accept* on every new privacy policy then you should learn what you've agreed to."
  },
  {
    "SessionId": "8ef77b38-292b-46ab-ad5c-7a3c07e66146",
    "SessionTitle": "What has 4 years of AWS Microservices taught me?",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "50+ developers pushing a 20 year old monolith towards a highly distributed system. I want to share what 8 development teams learn on this journey."
  },
  {
    "SessionId": "a439fbb1-b427-411c-8f3c-2644b5e2b161",
    "SessionTitle": "What I learned from the book “Designing UX: Forms by Jessica Enders”",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Forms are an essential part of most digital experiences, but they aren't always presented in a way that's usable for everyone–especially with 1 in 5 Australians suffering from some kind of disability. \n\nThe book \"Designing UX: Forms\" by Jessica Enders has become our bible at OpenCities, and has helped everyone in our team understand what the best practices are for all aspects of designing forms. \n\nI'll take you through the top tips we picked up, and share some examples of forms that follow these practices (plus some that don't)."
  },
  {
    "SessionId": "4ac2ad7d-b9e1-4d23-8c9e-e6811558c351",
    "SessionTitle": "What's new in Visual Studio Team Services",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Visual Studio Team Services is Microsoft's end-to-end DevOps solution - designed for any developer using any language on any platform.\r\n\r\nWith a 3-week delivery cadence, it's easy to lose track of the new features and capabilities. In this session I'll walk through some of the best new features that you may not know about, and highlight a few tips and tricks for getting the most out of VSTS. I have my favourites parts of the product, but they might not be yours - so make sure you bring your questions!"
  },
  {
    "SessionId": "6d079b1c-62b7-4c5b-bf54-8d83967f9a11",
    "SessionTitle": "What's New In Xamarin.Forms",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Xamarin.Forms has changed rapidly since its release. It is more performant. More robust. Richer in features. Learn about the changes that have been introduced recently and, more importantly, how you can leverage them to build world-class apps."
  },
  {
    "SessionId": "2c5667ca-bc12-4157-8dd5-ebe14b363a6f",
    "SessionTitle": "What’s your Impact in the World as a Developer?",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "'Developer: A person that creates something’\r\n\r\nAs a developer, our daily task is to write code, create software for users to use, and get paid. Is that all? \r\n\r\nOur job has much more impact than that. It affects the end-users that use it, the team members that we work with, the people from other departments like Marketing and PR, the customers of the users that use it, people from the infrastructure side like AWS, etc. It makes a difference in the world, good or bad.\r\n\r\nI strongly believe that when a customer does not think about the design of the product you developed but continues to use it-  then you have done a really amazing job. \r\n\r\nIn this session, I will explain the impact of our work as a developer, define and discover the sort of impact it has on the world, and how to leverage it. Hopefully, the talk will help you unlock the potential to do some truly great things and to have an even greater impact on the world as a developer."
  },
  {
    "SessionId": "51257776-ba59-4283-baed-569cbade7e1a",
    "SessionTitle": "When Serverless Meets Containers",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "One of benefits using serverless architecture is \"no need to worry about infrastructure management\". On the other hands, container technology is about \"no need to worry about setting up infrastructure\". They are two different directions of evolving cloud services. Now, they get together and play together. Actually they get along each other quite seamlessly.\r\n\r\nAt the end of this session, audiences will learn 1) why we need containers for serverless applications, 2) how this is possible in Azure Functions, 3) how Azure Functions application can be deployed to AWS, and 4) what other considerations we need to bring in for this combination."
  },
  {
    "SessionId": "70f91ae2-03b1-47c4-94f3-fef86ed782ca",
    "SessionTitle": "Who's My Favourite K-POP Star? – Azure Cognitive Services",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Do you know Gangnam Style from Psy? Do you know Fake Love from BTS? How about Red Flavour from Red Velvet? Who don't love K-POP nowadays? However, I know songs but I have no idea who's who.\r\n\r\nAzure Cognitive Services are Microsoft's Azure offering to build an AI powered application with ease, which includes Vision API that performs facial recognition. By uploading a photo, it identifies who is inside the photo.\r\n\r\nAt the end of this session, audiences will learn 1) what Azure Cognitive Service is, 2) how to let the service learn based on hundreds of photos, and 3) how to build a serverless application using Azure Cognitive Service APIs."
  },
  {
    "SessionId": "b3718ed2-92ea-4104-92c7-03d72f3ac71e",
    "SessionTitle": "Windows containers and how to modernise your existing .Net applications",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "This is continuation on the talk I did in the last DDD by Night. Not every existing .Net application is being rewritten on .Net Core and deployed on Linux containers. We still have many .Net applications build on .Net 4.5, 4.0 and even 3.5.\r\n\r\nThis talk will cover\r\n* Introducing Windows Containers using Docker on Windows.\r\n* Containerising legacy applications and modernise them.\r\n* Running Windows and Linux containers side by side."
  },
  {
    "SessionId": "c01798fa-acf8-47fe-9e11-25b97b2c5d77",
    "SessionTitle": "Writing Viruses for Fun, not Profit",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "Going viral hasn't always been considered good. Whether you're fighting the common cold, or trying to remove the ILOVEYOU computer worm from your corporate file server, two things are certain: your immune system is based on your gut health, and computers have really poor gut health.\r\n\r\nStopping viruses is hard. The main reason for this is that viruses are really clever. They've evolved over time to escape detection. Each previously detected virus allows the next iteration of the virus to become more resilient. The second reason is that your computer's gut health has to fight every virus, whereas each virus just has to find one immuno-compromised system to survive.\r\n\r\nLet's work out how viruses hide. How to they sneak past the checkpoints. How they attach themselves to your system. How they fight detection, and removal. We'll look at aspects such as self-replication, cryptographic obfuscation, and touch on methods of delivery and infection.\r\n\r\nNow that you're thinking like a virus writer, you can anticipate which areas of your applications need hardening. Just remember, we're doing it for good, not profit :)\r\n\r\nThis presentation will feature live demos of writing PHP viruses, and infection of willing targets. The theories apply equally to many languages, so an understanding of PHP is not required."
  },
  {
    "SessionId": "b2db232d-8832-441e-aa97-e5270c7234ab",
    "SessionTitle": "Zero Knowledge; Meeting the Growing Demand for Security and Privacy in a National Security World",
    "PresenterName": "",
    "PresenterTwitterAlias": "",
    "PresenterWebsite": "",
    "SessionAbstract": "We've all read the news; we're being surveilled as a massive level. Governments are indiscriminately collecting data, and storing it for years. Even if we trust our governments, this creates a honey-pot of information that criminals would love to get their hands on.\r\n\r\nSSL certificates and encryption are important for data transport, and yet even some of the bigger companies don't get it right. Encryption is hard, and it's not end-user friendly, but the tide is changing.\r\n\r\nWhat if your business needs to work with the data? End-to-end encryption between users isn't an option. How can we increase security and privacy, when we need to see our users' data? The principle of datensparsamkeit, to store only what you absolutely need, is still subject to concern if there's a data breach.\r\n\r\nThis talk discusses and demonstrates the options for end-to-end communications encryption in web applications, so that data can only be decoded by trusted users, and remains unreadable by the web application owner, or anyone who manages to get their hands on the underlying databases."
  }
]
